[
    {
        "type": "message",
        "user": "U0AKGKRST",
        "text": "<@U0AHQ8HD3>: It is easy to get things written by people but how to get things verified? I mean who shall have the right to verify? Also, the person who should how to get him to do it :confused:",
        "ts": "1442828680.000002"
    },
    {
        "type": "message",
        "user": "U0AQ1LRBQ",
        "text": "I think a 'system' for verification via email would be viable in long run. The User sends an email (generated by MetaKGP wiki) to the person who is going to verify. (Or he thinks, has the right to verify). (perhaps gmail integration would help?)\n\nThe Email contains :\n1.  link to the page, content of the page, too?\n2. Some verification link... ( 'I hereby say that this is authentic.. to the best of my knowledge.. types?) \n3. more?\n\nOf course, 'he thinks' the right to verify. (Alumni verification is important. Not all would Want to make an account, I suppose. no?)",
        "edited": {
            "user": "U0AQ1LRBQ",
            "ts": "1442829732.000000"
        },
        "ts": "1442829574.000003"
    },
    {
        "type": "message",
        "user": "U0AKGKRST",
        "text": "^Exactly my concern.",
        "ts": "1442829773.000006"
    },
    {
        "type": "message",
        "user": "U0AQ1LRBQ",
        "text": "Verification Right determination - \n---\n\n1. Person linked with the event (Involved, directly or indirectly (Now, indirectly... is a contentious issue... use something like 'association factor' ? ... like LinkedIn?). Author\/editor decides the 'connection' of the person with the event...) \n2. For 'crowd-participation' event, number of verifications are important.\n3.  Hall of residence info - Hall President ? Hall council? \n4.  Gymkhana info - G. Secs.? \n5.  ??\n\nIn all cases, Alumni verification could be helpful. Determining Alumni - User's\/Author's responsibility? Or could we take the data from Alumni Cell ... and give User some hints?\n\nHaving 'corollary rights' (Administrative\/management bodies linked to something.. ) and 'determined rights'(by User) could help.  metaKGP wiki could suggest User about 'corollary rights'.\n\nSuggestions Welcome :simple_smile: ",
        "edited": {
            "user": "U0AQ1LRBQ",
            "ts": "1442831405.000000"
        },
        "ts": "1442831014.000007"
    }
]